app/controllers/accounts_controller.rb

  def create
    @account = Account.new(account_params)

    if @account.save
---
INSERT INTO "accounts" ("created_at", "email", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-04-23 00:11:19.173752"], ["email", "gabe@milo.com"], ["updated_at", "2014-04-23 00:11:19.173752"]]

  def edit
    @account = Account.find(params[:id])
---
SELECT  "accounts".* FROM "accounts"  WHERE "accounts"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @account = Account.find(params[:id])

    if @account.update(account_params)
---
SELECT  "accounts".* FROM "accounts"  WHERE "accounts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "accounts" SET "email" = ?, "updated_at" = ? WHERE "accounts"."id" = 1  [["email", "gabe@milo.co"], ["updated_at", "2014-04-23 17:44:51.908232"]]

  def destroy
    @account = Account.find(params[:id])
    @account.destroy
---
SELECT  "accounts".* FROM "accounts"  WHERE "accounts"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "accounts" WHERE "accounts"."id" = ?  [["id", 1]]